In [2]:
import pandas as pd
import os
print(os.path.abspath('../'))

# set the path where you have downloaded the data files
file_path = os.path.abspath('../class3/')
print(file_path)

train = pd.read_csv(file_path + '/train_income_data_AAII.csv')
test = pd.read_csv(file_path + '/test_income_data_AAII.csv')

# For windows, if the above paths doesn't works
# import os
# f_path = os.path.join(*['C:', 'Users', 'user', 'Desktop', 'train_income_data_AAII.csv'])
# train = pd.read_csv(f_path)

# or maybe try following to reach to the path
# absolute_path = os.path.abspath(os.path.dirname('train_income_data_AAII.csv'))

C:\Users\Sheikh M Muneer\Documents
C:\Users\Sheikh M Muneer\Documents\class3

In [3]:
train.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [4]:
train.apply(lambda x : x.isnull()).head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False

In [5]:
# Column wise count
train.apply(lambda x : x.isnull().sum())

ID                   0
Age                  0
Workclass         1836
Education            0
Marital.Status       0
Occupation        1843
Relationship         0
Race                 0
Sex                  0
Hours.Per.Week       0
Native.Country     583
Income.Group         0
dtype: int64

In [6]:
# Row wise count . Just for demonstration
train.apply(lambda x : x.isnull().sum(),axis=1)

0        0
1        0
2        0
3        0
4        0
5        0
6        0
7        0
8        0
9        0
10       0
11       0
12       0
13       0
14       1
15       0
16       0
17       0
18       0
19       0
20       0
21       0
22       0
23       0
24       0
25       0
26       0
27       2
28       0
29       0
        ..
32531    2
32532    0
32533    0
32534    0
32535    0
32536    0
32537    0
32538    0
32539    2
32540    0
32541    2
32542    2
32543    0
32544    0
32545    0
32546    0
32547    0
32548    0
32549    0
32550    0
32551    0
32552    0
32553    0
32554    0
32555    0
32556    0
32557    0
32558    0
32559    0
32560    0
Length: 32561, dtype: int64

In [7]:
train['Workclass'].isnull().sum()

1836

In [8]:
train['Workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', nan, 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [9]:
train['Workclass'].value_counts()

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: Workclass, dtype: int64

In [10]:
train['Workclass'].value_counts().sum()

30725

In [11]:
null_df = train.loc[train['Workclass'].isnull()==True]  # loc is used for where clause or filter
null_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
27,28,54,NaN,Some-college,Married-civ-spouse,NaN,Husband,Asian-Pac-Islander,Male,60,South,>50K
61,62,32,NaN,7th-8th,Married-spouse-absent,NaN,Not-in-family,White,Male,40,NaN,<=50K
69,70,25,NaN,Some-college,Never-married,NaN,Own-child,White,Male,40,United-States,<=50K
77,78,67,NaN,10th,Married-civ-spouse,NaN,Husband,White,Male,2,United-States,<=50K
106,107,17,NaN,10th,Never-married,NaN,Own-child,White,Female,32,United-States,<=50K

In [12]:
## Most Occuring Value
d = train['Workclass'].mode()
print(d[0])

Private

In [13]:
type(d)

pandas.core.series.Series

In [14]:
import this

The Zen of Python, by Tim Peters

Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
Flat is better than nested.
Sparse is better than dense.
Readability counts.
Special cases aren't special enough to break the rules.
Although practicality beats purity.
Errors should never pass silently.
Unless explicitly silenced.
In the face of ambiguity, refuse the temptation to guess.
There should be one-- and preferably only one --obvious way to do it.
Although that way may not be obvious at first unless you're Dutch.
Now is better than never.
Although never is often better than *right* now.
If the implementation is hard to explain, it's a bad idea.
If the implementation is easy to explain, it may be a good idea.
Namespaces are one honking great idea -- let's do more of those!

## Missing Value Imputation

In [15]:
train['Workclass'].mode()[0]

'Private'

In [16]:
impute_list = ['Workclass','Occupation','Native.Country']
for imp_var in impute_list:
    print(imp_var)
    train[imp_var].fillna(train[imp_var].mode()[0],inplace=True)

Workclass
Occupation
Native.Country

In [17]:
train['Workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [18]:
train.apply(lambda x : x.isnull().sum())

ID                0
Age               0
Workclass         0
Education         0
Marital.Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Hours.Per.Week    0
Native.Country    0
Income.Group      0
dtype: int64

#### Mean Imputation for Numerical Data

In [19]:
train.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [20]:
train2_df = train.copy()

In [21]:
train2_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,38,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [22]:
train2_df['Age'][2]

38

In [23]:
import numpy as np

In [49]:
train2_df['Age'][2] = np.NaN

In [25]:
train2_df['Age'][2]

nan

In [26]:
train2_df.apply(lambda x : x.isnull().sum())

ID                0
Age               1
Workclass         0
Education         0
Marital.Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Hours.Per.Week    0
Native.Country    0
Income.Group      0
dtype: int64

In [27]:
replace_list = [5,50,80,100,200,300,400]

In [28]:
train2_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,39.0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50.0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,NaN,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53.0,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28.0,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [29]:
for indx in replace_list:
    train2_df['Age'][indx] = np.NaN

In [30]:
train2_df.apply(lambda x : x.isnull().sum())

ID                0
Age               8
Workclass         0
Education         0
Marital.Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Hours.Per.Week    0
Native.Country    0
Income.Group      0
dtype: int64

In [31]:
replace_list2 = []
for indx in range(0,32000):
    if indx%50 == 0:
        replace_list2.append(indx)

In [4]:
len(replace_list2)

640

In [33]:
for indx in replace_list2:
    train2_df['Age'][indx] = np.NaN

In [34]:
train2_df.apply(lambda x : x.isnull().sum())

ID                  0
Age               643
Workclass           0
Education           0
Marital.Status      0
Occupation          0
Relationship        0
Race                0
Sex                 0
Hours.Per.Week      0
Native.Country      0
Income.Group        0
dtype: int64

In [35]:
train2_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,NaN,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50.0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,NaN,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53.0,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28.0,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [36]:
zero_df = train2_df.copy()

In [37]:
zero_df['Age'] = zero_df['Age'].fillna(0)

In [38]:
zero_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,0.0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50.0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,0.0,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53.0,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28.0,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [39]:
zero_df.apply(lambda x : x.isnull().sum())

ID                0
Age               0
Workclass         0
Education         0
Marital.Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Hours.Per.Week    0
Native.Country    0
Income.Group      0
dtype: int64

In [40]:
train2_df['Age'].mean()

38.58885268500533

In [41]:
zero_df['Age'].mean()

37.826817358189246

In [42]:
zero_df.head()

,ID,Age,Workclass,Education,Marital.Status,Occupation,Relationship,Race,Sex,Hours.Per.Week,Native.Country,Income.Group
0,1,0.0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,<=50K
1,2,50.0,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,<=50K
2,3,0.0,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,<=50K
3,4,53.0,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,40,United-States,<=50K
4,5,28.0,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,40,Cuba,<=50K

In [43]:
mean_df = train2_df.copy()

In [44]:
mean_df.apply(lambda x : x.isnull().sum())

ID                  0
Age               643
Workclass           0
Education           0
Marital.Status      0
Occupation          0
Relationship        0
Race                0
Sex                 0
Hours.Per.Week      0
Native.Country      0
Income.Group        0
dtype: int64

In [45]:
mean_df['Age'] = mean_df['Age'].fillna(mean_df['Age'].mean())

In [46]:
mean_df.apply(lambda x : x.isnull().sum())

ID                0
Age               0
Workclass         0
Education         0
Marital.Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Hours.Per.Week    0
Native.Country    0
Income.Group      0
dtype: int64

In [47]:
train2_df['Age'].mean()

38.58885268500533

In [48]:
mean_df['Age'].mean()

38.58885268500559